---
kind: other
id: Methods.T:Autodesk.Revit.DB.ExportPatternTableIterator
source: html/1f48a714-e11a-7ad5-a527-d681cc1f0979.htm
---
# ExportPatternTableIterator Methods

Identifies if the iteration has completed.